## Week 1 Day 2-3 Practice

In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'C:\\Users\\sumai\\my_miniprojects\\DPhi'

 ● Load the CSV file into a variable - greenhouse_data

In [3]:
greenhouse_df = pd.read_csv("C:/Users/sumai/my_miniprojects/DPhi/greenhouse_data.csv")

 ● Use the description function to understand how the data looks like

In [4]:
greenhouse_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1204 entries, 0 to 1203
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  1204 non-null   object
 1   Year             1204 non-null   int64
 2   Value            1204 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.3+ KB

In [5]:
greenhouse_df.describe()

              Year         Value
count  1204.000000  1.204000e+03
mean   2003.500000  5.280785e+05
std       8.081104  1.283749e+06
min    1990.000000  8.412655e+01
25%    1996.750000  3.093901e+04
50%    2003.500000  8.069707e+04
75%    2010.250000  4.392478e+05
max    2017.000000  7.369968e+06

 ● Print its first 10 rows using head()

In [6]:
greenhouse_df.head()

  Country or Area  Year          Value
0       Australia  2017  554126.561371
1       Australia  2016  546771.759767
2       Australia  2015  535173.674335
3       Australia  2014  524957.101167
4       Australia  2013  530433.518839

 ● Print its last 10 rows using tail()

In [7]:
greenhouse_df.tail(10)

               Country or Area  Year         Value
1194  United States of America  1999  7.071461e+06
1195  United States of America  1998  7.032526e+06
1196  United States of America  1997  6.968462e+06
1197  United States of America  1996  6.907699e+06
1198  United States of America  1995  6.710067e+06
1199  United States of America  1994  6.624836e+06
1200  United States of America  1993  6.532070e+06
1201  United States of America  1992  6.424934e+06
1202  United States of America  1991  6.315615e+06
1203  United States of America  1990  6.371001e+06

 ● Check if there are any null values

In [8]:
greenhouse_df.isnull().sum()

Country or Area    0
Year               0
Value              0
dtype: int64

 ● Store the DataFrame to a CSV file named 'file2.csv'

In [9]:
greenhouse_df.to_csv('file2.csv')